package com.nuo.ydta.repository;

import com.nuo.ydta.domain.Clew;
import org.springframework.data.jpa.repository.JpaRepository;
import org.springframework.data.jpa.repository.JpaSpecificationExecutor;
import org.springframework.data.jpa.repository.Modifying;
import org.springframework.data.jpa.repository.Query;

public interface DbRepository extends JpaRepository<Clew,Integer>, JpaSpecificationExecutor<Clew> {

    @Query(value = "truncate table nuo_statistics;", nativeQuery = true)
    @Modifying
    void resetStatistics();

    @Query(value = "update nuo_stage set status = 0;", nativeQuery = true)
    @Modifying
    void resetStage();

    @Query(value = "update nuo_stage set status = 1 where id = 1;", nativeQuery = true)
    @Modifying
    void updateStage();

    @Query(value = "truncate table nuo_rolenpc;", nativeQuery = true)
    @Modifying
    void resetRoelNpc();

    @Query(value = "INSERT INTO `ydta`.`nuo_rolenpc`(`id`, `createdTime`, `updatedTime`, `version`, `favorability`, `npcId`, `roleId`, `npcName`, `roleName`)\n" +
            "VALUES (1,  NULL, NULL, 'v1', 40, 1, 1, '玉儿', '胡青'),\n" +
            "(2,  NULL, NULL, 'v1', 30, 1, 2, '玉儿', '姜亦'),\n" +
            "(3,  NULL, NULL, 'v1', 30, 1, 3, '玉儿', '灵欢'),\n" +
            "(4,  NULL, NULL, 'v1', 40, 1, 4, '玉儿', '蔡瑾'),\n" +
            "(5,  NULL, NULL, 'v1', 40, 1, 5, '玉儿', '山望'),\n" +
            "(6,  NULL, NULL, 'v1', 20, 1, 6, '玉儿', '璇儿'),\n" +
            "(7,  NULL, NULL, 'v1', 30, 1, 7, '玉儿', '万福'),\n" +
            "(8,  NULL, NULL, 'v1', 30, 1, 8, '玉儿', '姜城'),\n" +
            "(9,  NULL, NULL, 'v1', 20, 1, 9, '玉儿', '叶舒'),\n" +
            "(10, NULL, NULL, 'v1', 20, 1, 10, '玉儿', '芒云'),\n" +
            "(11, NULL, NULL, 'v1', 50, 1, 11, '玉儿', '君君'),\n" +
            "(12, NULL, NULL, 'v1', 30, 1, 12, '玉儿', '灵心'),\n" +
            "(13, NULL, NULL, 'v1', 30, 1, 13, '玉儿', '宇文杰'),\n" +
            "(14, NULL, NULL, 'v1', 30, 1, 14, '玉儿', '灵禾'),\n" +
            "(15, NULL, NULL, 'v1', 30, 1, 15, '玉儿', '无惧'),\n" +
            "(16, NULL, NULL, 'v1', 50, 1, 16, '玉儿', '芸娘'),\n" +
            "(17, NULL, NULL, 'v1', 30, 2, 1, '倏', '胡青'),\n" +
            "(18, NULL, NULL, 'v1', 30, 2, 2, '倏', '姜亦'),\n" +
            "(19, NULL, NULL, 'v1', 30, 2, 3, '倏', '灵欢'),\n" +
            "(20, NULL, NULL, 'v1', 30, 2, 4, '倏', '蔡瑾'),\n" +
            "(21, NULL, NULL, 'v1', 30, 2, 5, '倏', '山望'),\n" +
            "(22, NULL, NULL, 'v1', 30, 2, 6, '倏', '璇儿'),\n" +
            "(23, NULL, NULL, 'v1', 30, 2, 7, '倏', '万福'),\n" +
            "(24, NULL, NULL, 'v1', 30, 2, 8, '倏', '姜城'),\n" +
            "(25, NULL, NULL, 'v1', 30, 2, 9, '倏', '叶舒'),\n" +
            "(26, NULL, NULL, 'v1', 30, 2, 10, '倏', '芒云'),\n" +
            "(27, NULL, NULL, 'v1', 30, 2, 11, '倏', '君君'),\n" +
            "(28, NULL, NULL, 'v1', 30, 2, 12, '倏', '灵心'),\n" +
            "(29, NULL, NULL, 'v1', 30, 2, 13, '倏', '宇文杰'),\n" +
            "(30, NULL, NULL, 'v1', 30, 2, 14, '倏', '灵禾'),\n" +
            "(31, NULL, NULL, 'v1', 30, 2, 15, '倏', '无惧'),\n" +
            "(32, NULL, NULL, 'v1', 30, 2, 16, '倏', '芸娘'),\n" +
            "(33, NULL, NULL, 'v1', 30, 3, 1, '天华', '胡青'),\n" +
            "(34, NULL, NULL, 'v1', 40, 3, 2, '天华', '姜亦'),\n" +
            "(35, NULL, NULL, 'v1', 30, 3, 3, '天华', '灵欢'),\n" +
            "(36, NULL, NULL, 'v1', 40, 3, 4, '天华', '蔡瑾'),\n" +
            "(37, NULL, NULL, 'v1', 40, 3, 5, '天华', '山望'),\n" +
            "(38, NULL, NULL, 'v1', 30, 3, 6, '天华', '璇儿'),\n" +
            "(39, NULL, NULL, 'v1', 40, 3, 7, '天华', '万福'),\n" +
            "(40, NULL, NULL, 'v1', 30, 3, 8, '天华', '姜城'),\n" +
            "(41, NULL, NULL, 'v1', 20, 3, 9, '天华', '叶舒'),\n" +
            "(42, NULL, NULL, 'v1', 20, 3, 10, '天华', '芒云'),\n" +
            "(43, NULL, NULL, 'v1', 30, 3, 11, '天华', '君君'),\n" +
            "(44, NULL, NULL, 'v1', 40, 3, 12, '天华', '灵心'),\n" +
            "(45, NULL, NULL, 'v1', 30, 3, 13, '天华', '宇文杰'),\n" +
            "(46, NULL, NULL, 'v1', 30, 3, 14, '天华', '灵禾'),\n" +
            "(47, NULL, NULL, 'v1', 40, 3, 15, '天华', '无惧'),\n" +
            "(48, NULL, NULL, 'v1', 40, 3, 16, '天华', '芸娘'),\n" +
            "(49, NULL, NULL, 'v1', 30, 4, 1, '寒星', '胡青'),\n" +
            "(50, NULL, NULL, 'v1', 30, 4, 2, '寒星', '姜亦'),\n" +
            "(51, NULL, NULL, 'v1', 30, 4, 3, '寒星', '灵欢'),\n" +
            "(52, NULL, NULL, 'v1', 40, 4, 4, '寒星', '蔡瑾'),\n" +
            "(53, NULL, NULL, 'v1', 30, 4, 5, '寒星', '山望'),\n" +
            "(54, NULL, NULL, 'v1', 30, 4, 6, '寒星', '璇儿'),\n" +
            "(55, NULL, NULL, 'v1', 50, 4, 7, '寒星', '万福'),\n" +
            "(56, NULL, NULL, 'v1', 30, 4, 8, '寒星', '姜城'),\n" +
            "(57, NULL, NULL, 'v1', 40, 4, 9, '寒星', '叶舒'),\n" +
            "(58, NULL, NULL, 'v1', 20, 4, 10, '寒星', '芒云'),\n" +
            "(59, NULL, NULL, 'v1', 30, 4, 11, '寒星', '君君'),\n" +
            "(60, NULL, NULL, 'v1', 30, 4, 12, '寒星', '灵心'),\n" +
            "(61, NULL, NULL, 'v1', 40, 4, 13, '寒星', '宇文杰'),\n" +
            "(62, NULL, NULL, 'v1', 40, 4, 14, '寒星', '灵禾'),\n" +
            "(63, NULL, NULL, 'v1', 30, 4, 15, '寒星', '无惧'),\n" +
            "(64, NULL, NULL, 'v1', 30, 4, 16, '寒星', '芸娘'),\n" +
            "(65, NULL, NULL, 'v1', 30, 5, 1, '薛瑞', '胡青'),\n" +
            "(66, NULL, NULL, 'v1', 40, 5, 2, '薛瑞', '姜亦'),\n" +
            "(67, NULL, NULL, 'v1', 30, 5, 3, '薛瑞', '灵欢'),\n" +
            "(68, NULL, NULL, 'v1', 40, 5, 4, '薛瑞', '蔡瑾'),\n" +
            "(69, NULL, NULL, 'v1', 30, 5, 5, '薛瑞', '山望'),\n" +
            "(70, NULL, NULL, 'v1', 30, 5, 6, '薛瑞', '璇儿'),\n" +
            "(71, NULL, NULL, 'v1', 30, 5, 7, '薛瑞', '万福'),\n" +
            "(72, NULL, NULL, 'v1', 50, 5, 8, '薛瑞', '姜城'),\n" +
            "(73, NULL, NULL, 'v1', 0, 5, 9, '薛瑞', '叶舒'),\n" +
            "(74, NULL, NULL, 'v1', 20, 5, 10, '薛瑞', '芒云'),\n" +
            "(75, NULL, NULL, 'v1', 30, 5, 11, '薛瑞', '君君'),\n" +
            "(76, NULL, NULL, 'v1', 40, 5, 12, '薛瑞', '灵心'),\n" +
            "(77, NULL, NULL, 'v1', 40, 5, 13, '薛瑞', '宇文杰'),\n" +
            "(78, NULL, NULL, 'v1', 40, 5, 14, '薛瑞', '灵禾'),\n" +
            "(79, NULL, NULL, 'v1', 30, 5, 15, '薛瑞', '无惧'),\n" +
            "(80, NULL, NULL, 'v1', 30, 5, 16, '薛瑞', '芸娘'),\n" +
            "(81, NULL, NULL, 'v1', 30, 6, 1, '乔乔', '胡青'),\n" +
            "(82, NULL, NULL, 'v1', 70, 6, 2, '乔乔', '姜亦'),\n" +
            "(83, NULL, NULL, 'v1', 30, 6, 3, '乔乔', '灵欢'),\n" +
            "(84, NULL, NULL, 'v1', 40, 6, 4, '乔乔', '蔡瑾'),\n" +
            "(85, NULL, NULL, 'v1', 30, 6, 5, '乔乔', '山望'),\n" +
            "(86, NULL, NULL, 'v1', 30, 6, 6, '乔乔', '璇儿'),\n" +
            "(87, NULL, NULL, 'v1', 30, 6, 7, '乔乔', '万福'),\n" +
            "(88, NULL, NULL, 'v1', 40, 6, 8, '乔乔', '姜城'),\n" +
            "(89, NULL, NULL, 'v1', 0, 6, 9, '乔乔', '叶舒'),\n" +
            "(90, NULL, NULL, 'v1', 40, 6, 10, '乔乔', '芒云'),\n" +
            "(91, NULL, NULL, 'v1', 30, 6, 11, '乔乔', '君君'),\n" +
            "(92, NULL, NULL, 'v1', 30, 6, 12, '乔乔', '灵心'),\n" +
            "(93, NULL, NULL, 'v1', 30, 6, 13, '乔乔', '宇文杰'),\n" +
            "(94, NULL, NULL, 'v1', 30, 6, 14, '乔乔', '灵禾'),\n" +
            "(95, NULL, NULL, 'v1', 30, 6, 15, '乔乔', '无惧'),\n" +
            "(96, NULL, NULL, 'v1', 20, 6, 16, '乔乔', '芸娘'),\n" +
            "(97, NULL, NULL, 'v1', 30, 7, 1, '姜良', '胡青'),\n" +
            "(98, NULL, NULL, 'v1', 50, 7, 2, '姜良', '姜亦'),\n" +
            "(99, NULL, NULL, 'v1', 40, 7, 3, '姜良', '灵欢'),\n" +
            "(100,NULL, NULL, 'v1', 30, 7, 4, '姜良', '蔡瑾'),\n" +
            "(101,NULL, NULL, 'v1', 30, 7, 5, '姜良', '山望'),\n" +
            "(102,NULL, NULL, 'v1', 30, 7, 6, '姜良', '璇儿'),\n" +
            "(103,NULL, NULL, 'v1', 30, 7, 7, '姜良', '万福'),\n" +
            "(104,NULL, NULL, 'v1', 20, 7, 8, '姜良', '姜城'),\n" +
            "(105,NULL, NULL, 'v1', 20, 7, 9, '姜良', '叶舒'),\n" +
            "(106,NULL, NULL, 'v1', 50, 7, 10, '姜良', '芒云'),\n" +
            "(107,NULL, NULL, 'v1', 30, 7, 11, '姜良', '君君'),\n" +
            "(108,NULL, NULL, 'v1', 30, 7, 12, '姜良', '灵心'),\n" +
            "(109,NULL, NULL, 'v1', 30, 7, 13, '姜良', '宇文杰'),\n" +
            "(110,NULL, NULL, 'v1', 30, 7, 14, '姜良', '灵禾'),\n" +
            "(111,NULL, NULL, 'v1', 30, 7, 15, '姜良', '无惧'),\n" +
            "(112,NULL, NULL, 'v1', 30, 7, 16, '姜良', '芸娘'),\n" +
            "(113,NULL, NULL, 'v1', 40, 8, 1, '周疆主', '胡青'),\n" +
            "(114,NULL, NULL, 'v1', 40, 8, 2, '周疆主', '姜亦'),\n" +
            "(115,NULL, NULL, 'v1', 30, 8, 3, '周疆主', '灵欢'),\n" +
            "(116,NULL, NULL, 'v1', 30, 8, 4, '周疆主', '蔡瑾'),\n" +
            "(117,NULL, NULL, 'v1', 10, 8, 5, '周疆主', '山望'),\n" +
            "(118,NULL, NULL, 'v1', 30, 8, 6, '周疆主', '璇儿'),\n" +
            "(119,NULL, NULL, 'v1', 30, 8, 7, '周疆主', '万福'),\n" +
            "(120,NULL, NULL, 'v1', 50, 8, 8, '周疆主', '姜城'),\n" +
            "(121,NULL, NULL, 'v1', 20, 8, 9, '周疆主', '叶舒'),\n" +
            "(122,NULL, NULL, 'v1', 80, 8, 10, '周疆主', '芒云'),\n" +
            "(123,NULL, NULL, 'v1', 30, 8, 11, '周疆主', '君君'),\n" +
            "(124,NULL, NULL, 'v1', 70, 8, 12, '周疆主', '灵心'),\n" +
            "(125,NULL, NULL, 'v1', 50, 8, 13, '周疆主', '宇文杰'),\n" +
            "(126,NULL, NULL, 'v1', 30, 8, 14, '周疆主', '灵禾'),\n" +
            "(127,NULL, NULL, 'v1', 30, 8, 15, '周疆主', '无惧'),\n" +
            "(128,NULL, NULL, 'v1', 30, 8, 16, '周疆主', '芸娘');", nativeQuery = true)
    @Modifying
    void insertRoleNpc();


    @Query(value = "truncate table nuo_messagepush;", nativeQuery = true)
    @Modifying
    void resetMessagePush();

    @Query(value = "truncate table nuo_role;", nativeQuery = true)
    @Modifying
    void resetRole();

    @Query(value = "INSERT INTO `ydta`.`nuo_role`(`id`, `createdTime`, `updatedTime`, `version`, `gender`, `modifyCamp`, `name`, `play`, `serialNo`, `status`, `suspicion`, `halo`, `roleDesc`, `camp`, `url`, `vote`, `poll`) VALUES (1, '2019-10-09 16:23:28', '2019-10-28 08:38:21', 'v1', 1, b'1', '胡青', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', '862809046272605', 1, 0, 0, '醉尘阁打工小厮，为人木讷呆板', 5, '/tx/hq.png', b'0', 0),\n" +
            "(2, '2019-10-09 16:29:35', '2019-10-09 16:29:35', 'v1', 0, b'1', '姜亦', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489465', 1, 0, 0, '姜城女儿，飞扬跋扈的富二', 1, '/tx/jy.png', b'0', 0),\n" +
            "(3, '2019-10-09 16:33:19', '2019-10-09 16:33:19', 'v1', 0, b'0', '灵欢', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489466', 1, 0, 20, '灵心的贴身丫鬟，乖乖女模样，但也会一些武功', 4, '/tx/qh.png', b'0', 0),\n" +
            "(4, '2019-10-09 16:33:24', '2019-10-09 16:33:24', 'v1', 1, b'1', '蔡瑾', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489467', 1, 0, 0, '虽在姜城手下铁匠铺打工，但是是尤其在意干净的帅哥，聪明善谋略', 2, '/tx/cj.png', b'0', 0),\n" +
            "(5, '2019-10-09 16:47:41', '2019-10-09 16:47:41', 'v1', 1, b'1', '山望', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489468', 1, 0, 0, '芸娘的儿子，孱弱，小时候常被欺负，但是善良单纯', 1, '/tx/sw.png', b'0', 0),\n" +
            "(6, '2019-10-09 16:47:44', '2019-10-09 16:47:44', 'v1', 0, b'1', '璇儿', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489469', 1, 0, 0, '山望娘子，独具风格的美女，活泼机灵', 2, '/tx/xe.png', b'0', 0),\n" +
            "(7, '2019-10-09 16:47:49', '2019-10-09 17:01:12', 'v1', 1, b'1', '万福', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', '866592039624712', 1, 0, 0, '乐坊打工小厮，身材魁梧的暖男', 2, '/tx/wf.png', b'0', 0),\n" +
            "(8, '2019-10-09 16:47:53', '2019-10-09 16:59:33', 'v1', 1, b'1', '姜城', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489471', 1, 0, 0, '铁血依然有威严的老将军', 3, '/tx/jc.png', b'0', 0),\n" +
            "(9, '2019-10-09 16:47:57', '2019-10-09 16:47:57', 'v1', 1, b'1', '叶舒', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489472', 1, 0, 0, '乐坊打工的小厮，看不到他的真心，平时总是嬉皮笑脸，善于骗人', 3, '/tx/ys.png', b'0', 0),\n" +
            "(10, '2019-11-12 22:00:15', '2019-11-07 15:58:18', 'v1', 0, b'1', '芒云', '故事发生在这片叫做炎黄的大陆上，我的名字叫做芒云，但其实我还有一个身份是黎族的小女儿——黎云，我黎族在遥河以南，一片荒凉却广阔的土壤之上，名叫巨骸，那里气候炎热，地势险峻，而我家乡人也拥有着与那里为之匹配的坚毅与神勇，我们族人天生   我受家族安排，以芒族遗孤的名义被夏族的姬国师救起，由他献给夏族的王——周疆主，姬国师其实也是我黎族人，所以这一场戏是安排好的，那是混沌纪元55年，姬国师将我带到周疆主面前，说在夏族街巷发现的我，而我是芒族的幸存者，我只需要哭哭啼啼装作可怜，并且说黎族似乎与灵族也有来往，现在多了许多注灵武器，打得遥河以南民不聊生，我芒族便是其中之一。我看得出那名叫做灵心的女子，在我提到灵族之时的表情有多么难看，而我的出现就是为了挑拨这一切，为我黎族瓦解夏、灵两族，提供攻击机会的。我是与灵心完全不同的女子，灵心大气甚至能带兵打仗，对于局势有自己的分析与判断，而我则是做一名娇小的女人，天天依偎在周疆主的怀里，激发他的保护欲。渐渐地，灵心和周疆主之间有了隔阂，曾经他们会一起在三公人前主持大局，开会商议战术或是其他，我的出现之后，灵心明显将重心放在孩子身上更多，我想这是她的逃避吧。\\n而我和周疆主之间的感情却越来越浓烈，我会在他每日忙碌回来之时为他准备热水洗澡，为他轻轻的按揉着头部、肩部等等，他总说和我在一起是那么的放松和自在，我以小女人的姿态面对着他，常常晚上怀抱着他抚摸着他的头一边听他说着白天的烦心事，安慰他不管发生什么事他都有我的陪伴，我也十分意外，这个在外面都是苍劲有力形象的男人，却总是可以在我的面前表达着他的脆弱，偏偏是我看到的这些不为人知的一面，一开始的我，是悲悯他的，我觉得他最真实的一面居然是被我这个待他最不真诚的敌人看见，有些时候对他的安慰都带着一些可怜，可是后来我却似乎好像越来越享受这种被他需要的感觉。\\n我从周疆主那里知道了夏族的纷争，他的烦恼除了来自于和我黎族的战争还有与灵族微妙的关系之外，还有的就是夏族内部的三公纷争，这里的人都听周疆主的派遣，在他的下面有两位国师，一位姜国师，一位姬国师，姜国师跟着他的时间更长，主张和谐社会，取消阶级制度，取缔奴隶市场，而姬国师是我黎族的细作，平日里他也常常悄悄给我传递消息，要我辅助他在周疆主耳边吹风，该说些什么，为了搞乱夏族，他都主张人应该区分等级，这样才能带给大家动力去做好每一件事，而他一开始能成为国师也是因为他透露了一两次关于与黎族战争的重要信息而获得了周疆主的赏识，认为他有过人之处，其实那两次都是我黎族故意走漏的风声。而我的到来也为姬国师加了码，我和他成为周疆主身边最宠爱的两个人，而那些三公人自然而然就会想要找我们攀炎附势，我心里不止一次觉得“多么可悲的夏族人啊”，说到三公的架构，三公顾名思义分为三个部门，第一则是掌管武力的铁衣，主要负责X地境内外的安危，已经带兵训练等等，第二则是掌管文化传承的祭司，最后便是掌管判罚内务的律司。姬国师提出百姓需要分为四等，而且对于三公中的人也应该采取优胜劣汰，祭司、铁衣和律司也要开始划分等级，以夏族多有的矿石分级，上等为墨晶，中等为紫晶，下等为白晶。这个会影响他们每人的地位、收入和赋税，姬国师说动周疆主认为这样可以调动所有人的积极性，也会刺激越来越多优秀的人彰显能力，将夏族治理的更好，甚至可以有更多的能人能够去面对与黎族的战争。\\n那之后，明显三公中的人对我和姬国师的态度变得更加热情了，都希望我们能够在疆主面前美言，又或是觉得律司们会听我的话，认为我可以左右判罚的结果，一时之间我的房间倒是多了许多礼物。这个事情也反而加深了我和周疆主的感情，我从来不过问三公的事情，周疆主总说灵心却拿这些事和他争执，他觉得很不开心，而我就像是置身事外一般的逍遥，他说和我在一起不用去考虑这些问题的对错，而我总是支持着他。而他对我说了许多的海誓山盟，他说我是他这辈子遇到的最幸运的事情，他说他要一辈子待我好，只要是我喜欢的，他都会用尽一切办法满足我，他说他喜欢我笑起来的样子，可以让他忘记一切的烦恼。我的心似乎也渐渐地被眼前这名只在我面前卸下防备的男子融化了，在我黎族的家乡，征战沙场，一统炎黄大陆便是每个人的使命，我们的生命都是要为了这个理想而付出的，可是在周疆主这里，我看到了世界还要另外的一面，我开始贪图这样的快乐，我的快乐都是来自自己和我爱的人……我来夏族之前，家乡给我的任务只是扰乱夏族的超纲，给黎族可乘之机，若遇到黎族有需之时，可能还需要我亲手杀死周疆主，就算不是我杀，我也绝对不可以和他留下子嗣，在黎族看来，那将会是杂种。可是意外还是发生了，我怀上了周疆主的孩子，一开始的我惴惴不安，我害怕被姬国师知道后会拿我的孩子开刀，不论我和周疆主如何，我的内心是不愿意我的孩子受到任何伤害的，我想要有自己的孩子出世，让他感受着世间的美好。一开始这件事我瞒着所有人不敢声张，每日都做着平常没什么分别的事情，在我想出对策之前，我不想被别人先下手为强，而我却在某天清晨突然两眼发黑晕倒了，周疆主找来了熟悉药理的秦祭司，我被确诊有喜。周疆主非常高兴，他激动的抱着我说他要给我们的孩子全世界最好的一切，我能看出他的眼中是真心实意的激动与期待，我不忍打破他的幻想，一直没有开口说话，那之后，所有人都知道周疆主的第二夫人怀孕了，夫君传令下去，给我加了许多补品，我那里的守备力量也有所加强，看得出来他非常希望我可以安安稳稳的生下我们的孩子，我的心再一次被他打动，想到家乡人的至高理想是那么的冷冰冰，那一刻我决定要以自己的理想为重，事后果然姬国师来找过我，要我想办法将孩子流掉，他说那是黎族的命令，让我务必遵守，我都只是表面应和着，连哄带骗的对待姬国师，目的只是为了拖延时间，而我自己也开始处处小心，从姬国师处送来的礼物。\\n秦祭司奉命定期为我看诊，以稳定胎气胎心，有一日他却一副欲言又止的样子，我追问之下他也什么都没有说，反而有些回避我的眼神，只说改日再说，我没有过多询问他，只是觉得有些疑惑，不过有些其他三公人曾和我说秦祭司本就有些神经质，我也就没有太在意，但我没有想到的是，那之后，我没能再见到秦祭司，他被冯律司发现有蓄意谋害我肚中孩子的证据，从而被周疆主以谋反罪赐死，与他同天被赐死的还有林祭司和万铁衣，听说那两人是因为谋反的罪名。事发太突然，不禁让我有一丝的后怕，他究竟是受何人指使，到底还有谁在打我肚中的孩子的主意……那日周疆主回到我的身边温柔的抱着我说，他决不允许这种事情发生，让我别怕，有了他的安抚，我的心里感到很踏实，我知道自己越来越依赖他……\\n可还没等我回过神来，黎族便带兵攻打了过来，周疆主只得带着铁衣前去迎战，而另一边，姬国师直接亮明了身份，说他其实是黎族的细作，现在他要屠城，还到处嚷嚷着要杀死灵心的两个孩子周灵和周心，以及我肚中未出世的孩子。姬国师未曾将我的身份供出，我无法分辨这是否是他故意说着要杀我的孩子，其实是保护我身份的伎俩，总之周疆主在临走前，将一支最精锐的铁衣部队留下来专门保护我，那个领头的叫做姜城，据说是夏族最年轻的铁衣统领。那日，姬国师并未真的带兵来找过我，但是戏是演足了的，那一刻我便知道，黎族肯定还有重任要交给我，姬国师用他的生命来让我的身份坐实，事情一定非同小可，果不其然，在那日夏黎大战刚刚结束之时我便收到一封密信，是我的家乡来信（信上内容要让芒云记住黎族使命，要让她为难，不知道选黎族还是她刚刚有些感情的周疆主，还有君君的引出）我读完信后，心一直揪着疼，我不知道到底该何去何从……\\n那日夏黎大战中，是灵心在听闻周疆主节节败退之后，拿着他们夏、灵两族的圣器相结合前往战场支援，才将局面逆转，而黎族也带去了注灵武器，双方威力太大且不分上下，所以圣器都碎了一地，而那天她也失去了她的两个孩子，现在同样作为母亲的我，能够想象她有多痛苦，她在战后号召了很多人跟着她走，去建造一个理想的家园，她厌倦了这里的利益纷争，也厌倦了夏、灵之间的猜忌怀疑，或许这也代表她对周疆主不再有期望，她用她的方式告诉我说她输了。\\n她走后，我顺利的诞下了我的儿子——周洲，本来夏黎大战之后的周疆主有些一蹶不振，在看到周洲的那一刻，他还是幸福的笑了，那一刻的我也很满足。那天之后的夏族不再有权力的架构，周疆主也疲惫于那些纷争，也不再敢轻信他人，虽然他不说，但我能感觉到这件事对他的打击极大，街上也不再有奴隶市场，倒是有些大户店铺主动站出来说愿意收留许多无家可归之人，渐渐地夏族在平静中慢慢疗伤，而我也在思索着家乡密信之事……\\n随着时间的推移，越来越多的人忘记夏、黎之战的伤痛，也有许多新的生命降生在这里，带给X地生机，可我知道还有人没有从那天的痛苦中走出来，周疆主便是其中之一，他的年纪越来越大，再加上那天的多重打击，那之后他很难再有明媚的笑容，虽然很多人还是服从于他，但与他昔日的威严与雄风相比，不值一提，而我也渐渐地成为了他发泄情绪的对象，有的时候他喝了酒甚至会推开我，大声呵斥我要我离他远一点，但不知为何，我却总觉得这幅面孔下的他不是那么狠心的，他推开我或许至少担心我不再爱这样一个失败的他……可他不知道的是，其实我从来没有爱过那个威风凛凛的他，那时候的我更多的是为了黎族的任务，反而是这样和他的平淡日子，再加上孩子的出世，才让我的心渐渐地变得柔软，渐渐地真正的从心底接纳他。可是因为他过去对我的百般好，在如今却成为了许多人的口舌，而他听那些流言蜚语，心态越来越差，对我发火越来越多，甚至开始在夏族实行酷刑，用残暴的方法试图重新树立他的威严，我知道有很多人在背后都叫我妖女，说是我迷了周疆主的心智，让他成为昏君，听到这些的我也不知道是否还能走上前靠近他，我不知道怎么样才能让他好过一点，我们两个人明明挨得那么近，明明是那么的熟悉对方，如今却像是隔着一条银河。\\n这三十年间，夏族人看似平静于他的暴政之下，似乎又有着许多的暗涌，而君君此时也已经长大，开始为我四处探听消息，据我了解，如今有人集结了自己的势力，据说是希望可以扳倒周疆主这个昏君的统治，其实这对于我而言是完成最后的任务的最佳时机，我可以趁乱在其中加几把火，夏族人的欲望是无穷无尽的，他们总是可以开始自相残杀……可是我却陷入了深深的犹豫，我不再是年轻时那个无所畏惧的我，眼前那个黯然失色的男人到底现在对我是什么感情，我很好奇，我也想不清自己对待他又到底是何种感情了，只是如果我不照做任务，我的儿子却又面临着危机……我只能在各方势力中四处打探、来回周旋，最后做出我的抉择……（用儿子作为筹码加深芒云的矛盾，最后到底要选周疆主还是要选自己的儿子，任务可能是关于圣器）\\n而今日，灵心回来了，她还带着几位心腹，听说是黎族在遥河以南已经开始了侵略，她此番回来是为了和周疆主商议此事的，这似乎正是我做些什么的好时机……', '862809046272606', 1, 0, 0, '娇柔，风韵犹存的第二夫人', 5, '/tx/my.png', b'0', 0),\n" +
            "(11, '2019-10-09 16:48:04', '2019-10-09 16:48:04', 'v1', 1, b'1', '君君', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489474', 1, 0, 0, '被客栈收留的人之一，壮汉', 5, '/tx/jj.png', b'0', 0),\n" +
            "(12, '2019-10-09 16:48:07', '2019-10-09 16:48:07', 'v1', 0, b'1', '灵心', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489475', 1, 0, 20, '刚柔并济的大女人，会带兵打仗', 4, '/tx/lx.png', b'0', 0),\n" +
            "(13, '2019-10-09 16:48:11', '2019-10-09 16:48:11', 'v1', 1, b'1', '宇文杰', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489476', 1, 0, 0, '灵心的心腹之一，善文，唯唯诺诺，懦弱', 5, '/tx/yw.png', b'0', 0),\n" +
            "(14, '2019-10-09 16:48:14', '2019-10-10 16:13:49', 'v1', 1, b'1', '灵禾', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489477', 1, 0, 20, '灵心的心腹之一，善武，霸气', 4, '/tx/wh.png', b'0', 0),\n" +
            "(15, '2019-10-09 16:48:17', '2019-10-09 16:48:17', 'v1', 1, b'1', '无惧', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489478', 1, 0, 0, '乐坊打工小厮，冷漠不苟言笑的人，会武', 4, '/tx/wj.png', b'0', 0),\n" +
            "(16, '2019-10-09 16:48:20', '2019-10-09 16:48:20', 'v1', 0, b'1', '芸娘', '发货速度飞快哈市附近卡上房间开好技术开发好几十块话费可还是的看法哈斯柯达粉红色卡号放假卡号睡的房间卡号打扫房间卡了粉哈哈双方将卡号司法鉴定哈金斯柯达非户籍卡还是飞机看哈设计开发哈金斯柯达饭', 'sdfhk545489479', 1, 0, 0, '在客栈当洗衣娘的大姐，戴面具，默默无闻', 1, '/tx/yn.png', b'0', 0);\n", nativeQuery = true)
    @Modifying
    void insertRole();

    @Query(value = "truncate table nuo_clew;", nativeQuery = true)
    @Modifying
    void resetClew();

    @Query(value = "INSERT INTO `ydta`.`nuo_clew`(`id`, `createdTime`, `updatedTime`, `version`, `description`, `roleId`, `stageId`, `status`) VALUES (1, NULL, NULL, 'v1', '两条沾染干涸已久血迹的项链', 10, 1, 1),\n" +
            "(2, NULL, NULL, 'v1', '灵龟甲', 10, 1, 1),\n" +
            "(3, NULL, NULL, 'v1', '一张无惧寄给你，标注了多个可能是盛放圣器地址的地图', 10, 1, 1),\n" +
            "(4, NULL, NULL, 'v1', '对灵禾的人生期待计划书', 10, 1, 1),\n" +
            "(5, NULL, NULL, 'v1', '万氏的传家宝', 10, 1, 1),\n" +
            "(6, NULL, NULL, 'v1', '万铁衣的一封遗书', 10, 1, 1),\n" +
            "(7, NULL, NULL, 'v1', '偷偷拿走的灵欢与她心上人的信物', 10, 1, 1),\n" +
            "(8, NULL, NULL, 'v1', '日记', 10, 1, 1),\n" +
            "(9, NULL, NULL, 'v1', '你和万铁衣的双人画像', 10, 1, 1),\n" +
            "(10, NULL, NULL, 'v1', '和芒云一模一样的一些配饰', 10, 1, 1),\n" +
            "(11, NULL, NULL, 'v1', '一朵失去叶子的芙蓉花中间有蓝色粉末', 12, 1, 1),\n" +
            "(12, NULL, NULL, 'v1', '周疆主救下你那天，你手上留下的伤疤', 12, 1, 1),\n" +
            "(13, NULL, NULL, 'v1', '刻有黎语“容”字的木钗', 12, 1, 1),\n" +
            "(14, NULL, NULL, 'v1', '黎族字典', 12, 1, 1),\n" +
            "(15, NULL, NULL, 'v1', '黎族威胁你的密信', 12, 1, 1),\n" +
            "(16, NULL, NULL, 'v1', '你引荐胡青成为祭祀候选人的昭告', 12, 1, 1),\n" +
            "(17, NULL, NULL, 'v1', '胡青与周容的指婚文书密函，还未昭告', 12, 1, 1),\n" +
            "(18, NULL, NULL, 'v1', '帮助宇文杰完成他的研究项目的凝宝斋购物清单', 12, 1, 1),\n" +
            "(19, NULL, NULL, 'v1', '周容身上荷包装有一枚圣器碎片', 12, 1, 1),\n" +
            "(20, NULL, NULL, 'v1', '你来到夏族之时抽取的一罐不同于夏族人的血', 12, 1, 1),\n" +
            "(21, NULL, NULL, 'v1', '你写给玉渊芒依的暗信，结尾都会关心姐姐的手', 12, 1, 1),\n" +
            "(22, NULL, NULL, 'v1', '周疆主为你作的肖像画、送的绸缎布匹等礼物', 12, 1, 1);", nativeQuery = true)
    @Modifying
    void insertClew();

    @Query(value = "update nuo_play set status = 0;", nativeQuery = true)
    @Modifying
    void resetPlay();

    @Query(value = "truncate table nuo_task;", nativeQuery = true)
    @Modifying
    void resetTask();


    @Query(value = "INSERT INTO `ydta`.`nuo_task`(`id`, `createdTime`, `updatedTime`, `description`, `roleId`, `stageId`, `status`, `version`) VALUES (NULL, NULL, '2019-11-07 15:19:17', '查出杀害冯律司的凶手', 0, 2, 0, ''),\n" +
            "(NULL, NULL, '2019-11-07 15:36:41', '查出杀害周疆主的凶手', 0, 4, 0, ''),\n" +
            "(NULL, NULL, '2019-11-07 15:36:56', '查出杀害第三位死者的凶手', 0, 7, 0, ''),\n" +
            "(NULL, NULL, '2019-11-07 15:39:56', '推选新人疆主的任务', 0, 14, 0, ''),\n" +
            "(NULL, NULL, NULL, '凶手隐藏任务2', 0, 0, 0, ''),\n" +
            "(NULL, NULL, NULL, '凶手隐藏任务2', 0, 0, 0, ''),\n" +
            "(NULL, NULL, NULL, '找到周洲的线索', 10, 1, 1, ''),\n" +
            "(NULL, NULL, NULL, '隐藏你是杀害冯律司的凶手', 3, 1, 1, NULL),\n" +
            "(NULL, NULL, NULL, '隐藏你是“黄帮”势力真实老大这件事', 8, 1, 1, NULL),\n" +
            "(NULL, NULL, NULL, '带上你的毒药，找寻没人看见的时机，去给周疆主的面具（夏晗居中）涂毒', 15, 1, 1, NULL),\n" +
            "(NULL, NULL, NULL, '待东窗事发之时，隐藏你是凶手的事情', 15, 1, 1, NULL),\n" +
            "(NULL, NULL, NULL, '前往暗室，完成你密谋的最后一步，将你仿造的物件放在乐坊的暗室中，等待周疆主前往；', 9, 1, 1, NULL),\n" +
            "(NULL, NULL, NULL, '待东窗事发之时，隐藏你是凶手的事情', 9, 1, 1, NULL),\n" +
            "(NULL, NULL, NULL, '完成寒星的要求，从而获得一次她的祝福', 10, 11, 0, ''),\n" +
            "(NULL, NULL, NULL, '尽量让己方势力财力保持最多', 10, 11, 0, ''),\n" +
            "(NULL, NULL, NULL, '己方势力不可有细作', 10, 11, 0, ''),\n" +
            "(NULL, NULL, NULL, '尽量让己方势力人数占多', 10, 11, 0, ''),\n" +
            "(NULL, NULL, NULL, '尽量先人一步集齐圣器碎', 10, 8, 0, ''),\n" +
            "(NULL, NULL, NULL, '做出阵营的抉择', 10, 8, 0, ''),\n" +
            "(NULL, NULL, NULL, '继续调查凶手', 10, 8, 0, '');", nativeQuery = true)
    @Modifying
    void insertTask();




}
